*&---------------------------------------------------------------------*
*& Report ZABA10_09_LOOPS
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT ZABA10_09_LOOPS.

DO 3 TIMES.
  write / 'Проход цикла номер: ' && sy-index.
ENDDO.

DO.
  write / 'Проход цикла номер: ' && sy-index.
  IF sy-index > 10.
EXIT.
  ENDIF.
ENDDO.

WHILE sy-index <= 10 AND sy-index <> 7.
  WRITE / 'Проход цикла номер: ' && sy-index.
ENDWHILE.
